Update README with Mermaid diagram (tech map)
